       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA-MUNDO.
       PROCEDURE DIVISION.
           DISPLAY "¡Hola, mundo COBOL desde Vladisystems!".
           STOP RUN.
